In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df1=pd.DataFrame(np.arange(9).reshape(3,3),index=['2000','2001','2002'],columns=['Ohio','California','America'])

In [4]:
df2=pd.DataFrame(np.arange(12).reshape(3,4),index=['2000','2001','2002'],columns=['Ohio','California','America','India'])

In [5]:
df1

      Ohio  California  America
2000     0           1        2
2001     3           4        5
2002     6           7        8

In [6]:
df2

      Ohio  California  America  India
2000     0           1        2      3
2001     4           5        6      7
2002     8           9       10     11

In [7]:
df1+df2

      America  California  India  Ohio
2000        4           2    NaN     0
2001       11           9    NaN     7
2002       18          16    NaN    14